app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "city", "zip", "updated_at", "cost", "street_address", "capacity", "created_at") VALUES('The West End Tavern', 'Boulder', '80302', '2009-03-11 01:49:38', NULL, '8th and Pearl', NULL, '2009-03-11 01:49:38')
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save