app/controllers/ticket_types_controller.rb

SELECT * FROM "ticket_types" WHERE ("ticket_types"."id" = 1)
---
  def show
    @ticket_type = TicketType.find(params[:id])

INSERT INTO "ticket_types" ("name", "updated_at", "created_at") VALUES('Member Only', '2009-03-11 01:52:33', '2009-03-11 01:52:33')
---
  def create
    @ticket_type = TicketType.new(params[:ticket_type])

    respond_to do |format|
      if @ticket_type.save